In [1]:
import pandas as pd

In [3]:
print(pd.__version__)

1.4.2

In [4]:
A = pd.Series([2,3,4,5],index=['a','b','c','d'])

In [6]:
type(A.values)

numpy.ndarray

In [7]:
type(A)

pandas.core.series.Series

In [8]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
A['a']

2

In [10]:
A['a':'c']

a    2
b    3
c    4
dtype: int64

In [11]:
grades_dict = {"A":4,"B":3.5,"C":3,"D":2.5}
grades = pd.Series(grades_dict)

In [14]:
grades.values

array([4. , 3.5, 3. , 2.5])

In [15]:
marks_dict = {"A":85,"B":75,"C":65,"D":55}
marks = pd.Series(marks_dict)

In [16]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [17]:
 grades

A    4.0
B    3.5
C    3.0
D    2.5
dtype: float64

In [18]:
marks["A"]

85

In [19]:
 marks[0:2]

A    85
B    75
dtype: int64

In [20]:
D = pd.DataFrame({'Marks':marks,'Grades':grades})

In [21]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [22]:
D.T

           A     B     C     D
Marks   85.0  75.0  65.0  55.0
Grades   4.0   3.5   3.0   2.5

In [23]:
D.values

array([[85. ,  4. ],
       [75. ,  3.5],
       [65. ,  3. ],
       [55. ,  2.5]])

In [24]:
D.values[2,0]

65.0

In [25]:
D.columns

Index(['Marks', 'Grades'], dtype='object')

In [26]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [27]:
D['ScaledMarks'] = 100*(D['Marks']/90)

In [28]:
D

   Marks  Grades  ScaledMarks
A     85     4.0    94.444444
B     75     3.5    83.333333
C     65     3.0    72.222222
D     55     2.5    61.111111

In [29]:
del D["ScaledMarks"]

In [30]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [31]:
G = D[D['Marks']>70]

In [32]:
G

   Marks  Grades
A     85     4.0
B     75     3.5

In [33]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [36]:
A= pd.DataFrame([{'a':1,'b':4},{'b':-3,'c':9}])

In [37]:
A

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [38]:
A.fillna(0)

     a  b    c
0  1.0  4  0.0
1  0.0 -3  9.0

In [39]:
A.dropna()

Empty DataFrame
Columns: [a, b, c]
Index: []

In [40]:
A

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [41]:
A.fillna(0)

     a  b    c
0  1.0  4  0.0
1  0.0 -3  9.0

In [42]:
A = pd.Series(['a','b','c'], index=[1,3,5])

In [43]:
A[1]

'a'

In [44]:
A[1:3]

3    b
5    c
dtype: object

In [47]:
A.iloc[1:3]

3    b
5    c
dtype: object

In [48]:
 D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [49]:
D.iloc[2,:]

Marks     65.0
Grades     3.0
Name: C, dtype: float64

In [50]:
D.iloc[::-1,:]

   Marks  Grades
D     55     2.5
C     65     3.0
B     75     3.5
A     85     4.0

In [51]:
from sklearn.impute import SimpleImputer

In [54]:
df = pd.read_csv('C:\\Users\\dipesh.wosti\\pythonProject3\\covid_19_clean_complete.csv')

In [56]:
df.head(10)

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered,Active,WHO Region
0,NaN,Afghanistan,33.93911,67.709953,2020-01-22,0,0,0,0,Eastern Mediterranean
1,NaN,Albania,41.15330,20.168300,2020-01-22,0,0,0,0,Europe
2,NaN,Algeria,28.03390,1.659600,2020-01-22,0,0,0,0,Africa
3,NaN,Andorra,42.50630,1.521800,2020-01-22,0,0,0,0,Europe
4,NaN,Angola,-11.20270,17.873900,2020-01-22,0,0,0,0,Africa
5,NaN,Antigua and Barbuda,17.06080,-61.796400,2020-01-22,0,0,0,0,Americas
6,NaN,Argentina,-38.41610,-63.616700,2020-01-22,0,0,0,0,Americas
7,NaN,Armenia,40.06910,45.038200,2020-01-22,0,0,0,0,Europe
8,Australian Capital Territory,Australia,-35.47350,149.012400,2020-01-22,0,0,0,0,Western Pacific
9,New South Wales,Australia,-33.86880,151.209300,2020-01-22,0,0,0,0,Western Pacific

In [57]:
df.drop(['WHO Region'],axis=1,inplace=True)

In [59]:
df.head(5)

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered,Active
0,NaN,Afghanistan,33.93911,67.709953,2020-01-22,0,0,0,0
1,NaN,Albania,41.15330,20.168300,2020-01-22,0,0,0,0
2,NaN,Algeria,28.03390,1.659600,2020-01-22,0,0,0,0
3,NaN,Andorra,42.50630,1.521800,2020-01-22,0,0,0,0
4,NaN,Angola,-11.20270,17.873900,2020-01-22,0,0,0,0

In [60]:
df.rename(columns={'Country/Region':'Country','Province/State':'Province'},inplace=True)

In [61]:
df.head()

,Province,Country,Lat,Long,Date,Confirmed,Deaths,Recovered,Active
0,NaN,Afghanistan,33.93911,67.709953,2020-01-22,0,0,0,0
1,NaN,Albania,41.15330,20.168300,2020-01-22,0,0,0,0
2,NaN,Algeria,28.03390,1.659600,2020-01-22,0,0,0,0
3,NaN,Andorra,42.50630,1.521800,2020-01-22,0,0,0,0
4,NaN,Angola,-11.20270,17.873900,2020-01-22,0,0,0,0

In [62]:
df.del(Lat)

SyntaxError: invalid syntax (4284838909.py, line 1)

In [63]:
df.drop(Lat)

NameError: name 'Lat' is not defined

In [65]:
df.drop({'Lat','Long'},axis=1,inplace = True)

In [66]:
df.head()

  Province      Country        Date  Confirmed  Deaths  Recovered  Active
0      NaN  Afghanistan  2020-01-22          0       0          0       0
1      NaN      Albania  2020-01-22          0       0          0       0
2      NaN      Algeria  2020-01-22          0       0          0       0
3      NaN      Andorra  2020-01-22          0       0          0       0
4      NaN       Angola  2020-01-22          0       0          0       0

In [67]:
df['Date'] = pd.to_datetime(df['Date'])

In [71]:
df.describe()

          Confirmed         Deaths     Recovered        Active
count  4.906800e+04   49068.000000  4.906800e+04  4.906800e+04
mean   1.688490e+04     884.179160  7.915713e+03  8.085012e+03
std    1.273002e+05    6313.584411  5.480092e+04  7.625890e+04
min    0.000000e+00       0.000000  0.000000e+00 -1.400000e+01
25%    4.000000e+00       0.000000  0.000000e+00  0.000000e+00
50%    1.680000e+02       2.000000  2.900000e+01  2.600000e+01
75%    1.518250e+03      30.000000  6.660000e+02  6.060000e+02
max    4.290259e+06  148011.000000  1.846641e+06  2.816444e+06

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49068 entries, 0 to 49067
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Province   14664 non-null  object
 1   Country    49068 non-null  object
 2   Date       49068 non-null  datetime64[ns]
 3   Confirmed  49068 non-null  int64
 4   Deaths     49068 non-null  int64
 5   Recovered  49068 non-null  int64
 6   Active     49068 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(2)
memory usage: 2.6+ MB

In [78]:
df = df.fillna('NA')

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49068 entries, 0 to 49067
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Province   49068 non-null  object
 1   Country    49068 non-null  object
 2   Date       49068 non-null  datetime64[ns]
 3   Confirmed  49068 non-null  int64
 4   Deaths     49068 non-null  int64
 5   Recovered  49068 non-null  int64
 6   Active     49068 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(2)
memory usage: 2.6+ MB